Revit 2027 API
RoutingCondition.Diameter Property
 The diameter of the segment or fitting specified for the routing condition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Diameter { get; }
Public ReadOnly Property Diameter As Double
	Get
public:
property double Diameter {
	double get ();
}
member Diameter : float with get
Property Value
Double
See Also
Reference
RoutingCondition Class
Autodesk.Revit.DB Namespace